Revit 2026 API

# IFailuresPreprocessor Interface

---

An interface that may be used to perform a preprocessing step to either filter out anticipated transaction failures or to mark certain failures as non-continuable.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public interface IFailuresPreprocessor
```
```vb
Public Interface IFailuresPreprocessor
```
```cpp
public interface class IFailuresPreprocessor
```
```fsharp
type IFailuresPreprocessor = interface end
```

The IFailuresPreprocessor type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | PreprocessFailures | This method is called when there have been failures found at the end of a transaction and Revit is about to start processing them. |

This interface, if provided, is invoked when there are failures found at the end of a transaction. An instance of this interface can be set in the failure handling options of transaction object.

#### Reference

Autodesk.Revit.DB Namespace